def get_totem_animal(points):
    if points < 26:
        return {
    'text': 'Поздравляем! Ваше тотемное животное – Египетская цапля.\n\n\
    Египетская цапля — это одна из самых величественных и загадочных птиц, обитающих в Африке. Её длинная шея и грациозные ноги придают ей элегантный вид, а переливчатое оперение, играющее всеми оттенками серого и синего цветов, создаёт вокруг неё таинственную ауру. Египетская цапля также известна своими громкими криками, которые можно услышать на большом расстоянии. Эти звуки, разносящиеся над гладью воды, создают завораживающую атмосферу и помогают птицам общаться друг с другом и предупреждать о возможной опасности. \n\n\
    Подробнее: https://moscowzoo.ru/animals/kinds/egipetskaya_caplya',
    'image': 'img/heron.png'
}
    elif points >= 26 and points < 29:
        return {
    'text': 'Поздравляем! Ваше тотемное животное – Фенёк.\n\n\
    Фенек - это замечательное, необычное и удивительное животное, которое вызывает волнение и восхищение у тех, кто его видит. Это маленькое, очаровательное существо имеет невероятно мягкое и рыжий мех, который кажется тонусным, то и дело меняя цвет от золотистого до коричневого. Несмотря на свою небольшую величину, фенек обладает замечательной выносливостью и может прожить до 14 лет в неволе. Он является моногамным животным и образует пару на всю жизнь.\n\n\
    Подробнее: https://moscowzoo.ru/animals/kinds/fenek',
    'image': 'img/fenec.png'
}
    elif points >= 29 and points <= 33:
        return {
    'text': 'Поздравляем! Ваше тотемное животное – Европейский волк.\n\n\
    В своей природе, европейский волк - это символ свободы, непревзойденной красоты и неудержимой силы.Своим величественным обликом и красивым мехом, европейский волк внушает уважение и страх. Его глаза, блестящие как звезды, пронизывают душу, в то время как его уши смотрят вперёд, что говорит о его вечной готовности к действию.\n\n\
    Подробнее: https://moscowzoo.ru/animals/kinds/evropeyskiy_volk',
    'image': 'img/wolf.png'
    }
    elif points > 33 and points <= 36:
        return {
    'text': 'Поздравляем! Ваше тотемное животное – Снежный барс.\n\n\
    Снежный барс — великолепное и грациозное животное, обладающее невероятной красотой и уникальной силой. Это гордый хищник, обитающий в суровых горных районах Центральной и Южной Азии. Его роскошная меховая шкура, окрашенная в нежные серые и белые тона, украшена черными пятнами, что делает его почти незаметным на фоне снежных и каменистых ландшафтов.Эти замечательные животные известны своей ловкостью и храбростью. Они способны прыгать на расстояние до шести метров, что делает их одними из самых ловких животных в горах.\n\n\
    Подробнее: https://moscowzoo.ru/animals/kinds/irbis_snezhnyy_bars',
    'image': 'img/snow_bars.png'
    }
    elif points > 36 and points <= 40:
        return {
    'text': 'Поздравляем! Ваше тотемное животное – Какаду гоффина.\n\n\
    Какаду Гоффина — это изысканная, изящная птица, чья природная грация и очарование восхищают даже самых взыскательных любителей пернатых. Характер этих птиц — отдельная их драгоценность. Они невероятно сообразительны и общительны, с лёгкостью обучаются трюкам и даже могут подражать человеческой речи. Их сообразительность делает их одними из лучших мастеров побегов среди птиц.\n\n\
    Подробнее: https://moscowzoo.ru/animals/kinds/kakadu_goffina',
    'image': 'img/kakadu.png'
    }
    elif points > 40 and points <= 43:
        return {
    'text': 'Поздравляем! Ваше тотемное животное – Альпака.\n\n\
    Альпака — это невероятно очаровательное и грациозное существо, которое завораживает своим мягким, пушистым оперением и добродушным характером. Эти домашние животные, родом из высоких гор Анд, славятся своим Экзотическим внешним видом и дружелюбным нравом. Альпака символизирует гармонию с природой и умиротворение. Они напоминают нам о важности бережного отношения к животным и окружающей среде. Эти милые создания способны подарить теплоту и радость, оставляя незабываемые впечатления у всех, кто хоть раз встретил их в своей жизни.\n\n\
    Подробнее: https://moscowzoo.ru/animals/kinds/alpaka',
    'image': 'img/alpaka.png'
    }
    elif points > 43 and points <= 46:
        return {
    'text': 'Поздравляем! Ваше тотемное животное – Розовый фламинго.\n\n\
    Розовый фламинго — это воплощение грации и элегантности, птица, чьё величественное присутствие неизменно притягивает взгляды. Их утончённое тело, вытянутое в идеальных пропорциях, украшают перья удивительно нежного розового оттенка, который варьируется от нежно-персикового до насыщенного кораллового. Эта птица — символ природной гармонии и изысканной красоты. Их образы вдохновляют художников, поэтов и мечтателей, а их уникальный стиль жизни напоминает о хрупкости и величии мира дикой природы.\n\n\
    Подробнее: https://moscowzoo.ru/animals/kinds/rozovyy_flamingo',
    'image': 'img/flamingo.png'
    }
    elif points > 46 and points <= 51:
        return {
    'text': 'Поздравляем! Ваше тотемное животное – Морской заяц.\n\n\
    Морской заяц — удивительное создание морских глубин, поражающее воображение своей загадочной внешностью и необычным образом жизни. Морской заяц поражает своей пластичностью и грацией движений. Он способен плавать, элегантно изгибая тело и напоминая развевающийся шелковый платок, или же неспешно ползать по дну, словно исследуя каждую песчинку.\n\n\
    Подробнее: https://moscowzoo.ru/animals/kinds/morskoy_zayac',
    'image': 'img/seaHare.png'
    }
