questions = [
    {
        #1
        'question': '1. Какое место вы бы выбрали для строительства дома?\n1) Горы\n2) Лес или степи\n3) Побережье\n4) Пустыня\n5) Равнина',
        'answers': ['1', '2', '3', '4', '5'],
        'points': [3, 2, 5, 2, 4]
    },
    {
        #2
        'question': '2. Какой вид отдыха вы предпочитаете?\n1) Активный отдых на природе\n2) Путешествия по экзотическим странам\n3) Спокойный отдых у моря\n4) Изучение новых культур и традиций\n5) Творческий отпуск, полный вдохновения',
        'answers': ['На природе', 'Экзотические страны', 'У моря', 'Изучение различных культур', 'Творческий'],
        'points': [4, 4, 2, 5, 4]
    },
    {
        #3
        'question': '3. Как вы воспринимаете критику?\n1) Принимаю её конструктивно и стараюсь улучшить свои навыки\n2) Обижаюсь и злюсь\n3) Игнорирую её, считая, что она не имеет значения\n4) Слушаю её внимательно и стараюсь понять точку зрения другого человека\n5) Отношусь к ней с юмором и не принимаю близко к сердцу',
        'answers': ['1', '2', '3', '4', '5'],    
        'points': [3, 2, 4, 4, 4]
    },
    {
        #4
        'question': '4. Как вы достигаете своих целей?\n1) Ставлю перед собой чёткие цели и разрабатываю план действий\n2) Ищу поддержку и помощь у других людей\n3) Следую своим инстинктам и интуиции\n4) Анализирую ситуацию и выбираю наиболее подходящий вариант действий\n5) Мечтаю о большом и верю в лучшее',
        'answers': ['Четкие цели', 'Поддержка и помощь', 'Следую инстинктам', 'Анализирую ситуацию', 'Думаю о лучшем'],
        'points': [4, 4, 2, 3, 4]
    },
    {
        #5
        'question': '5. Как вы обычно решаете конфликты?\n1) Иду напролом, отстаивая свою позицию\n2) Стараюсь найти компромисс\n3) Избегаю конфликтов, стараясь сохранить мир\n4) Обсуждаю проблему и ищу решение вместе с другими\n5) Использую юмор и лёгкость, чтобы разрядить обстановку',
        'answers': ['1', '2', '3', '4', '5'],
        'points': [3, 2, 5, 4, 4]
    },
    {
        #6
        'question': '6. Что для вас важнее всего в дружбе?\n1) Верность и преданность\n2) Умение поддержать и быть рядом в трудную минуту\n3) Общие интересы и увлечения\n4) Честность и открытость\n5) Веселье и радость общения',
        'answers': ['1', '2', '3', '4', '5'],
        'points': [4, 2, 3, 3, 4]
    },
    {
        #7
        'question': '7. Как вы относитесь к переменам в жизни?\n1) Люблю перемены и всегда готов к новым приключениям\n2) Предпочитаю стабильность и не люблю неожиданностей\n3) Готов к переменам, если они ведут к лучшему\n4) Боюсь перемен и стараюсь их избегать\n5) Воспринимаю перемены как возможность для роста и развития',
        'answers': ['1', '2', '3', '4', '5'],
        'points': [2, 5, 4, 2, 3]
    },
    {
        #8
        'question': '8. Как вы справляетесь со стрессом?\n1) Занимаюсь спортом или физической активностью\n2) Провожу время с друзьями и близкими\n3) Практикую медитацию или йогу\n4) Читаю книги или смотрю фильмы\n5) Занимаюсь творчеством',
        'answers': ['1', '2', '3', '4', '5'],
        'points': [4, 4, 2, 5, 4]
    },
    {
        #9
        'question': '9. Как вы проводите свободное время?\n1) Гуляю на свежем воздухе\n2) Посещаю музеи и выставки\n3) Играю в настольные игры или читаю книги\n4) Встречаюсь с друзьями и хожу на вечеринки\n5) Путешествую и изучаю новые места',
        'answers': ['1', '2', '3', '4', '5'],
        'points': [2, 4, 5, 3, 2]
    },
    {
        #10
        'question': '10. Как вы выражаете свои чувства?\n1) Через действия и поступки\n2) Через слова и разговоры\n3) Через творчество и искусство\n4) Через мимику и жесты\n5) Через объятия и прикосновения',
        'answers': ['1', '2', '3', '4', '5'],
        'points': [4, 3, 4, 2, 5]
    }
]

# а) Горы (снежный барс).
# б) Лес или степи (фенёк).
# в) Побережье (морской заяц).
# г) Пустыня (цапля).
# д) Равнина (фламинго).

# Какой вид отдыха вы предпочитаете?
# а) Активный отдых на природе (волк).
# б) Путешествия по экзотическим странам (какаду).
# в) Спокойный отдых у моря (морской заяц).
# г) Изучение новых культур и традиций (альпака).
# д) Творческий отпуск, полный вдохновения (фламинго).

# Как вы обычно решаете конфликты?
# а) Иду напролом, отстаивая свою позицию (барс).
# б) Стараюсь найти компромисс (фенёк).
# в) Избегаю конфликтов, стараясь сохранить мир (морской заяц).
# г) Обсуждаю проблему и ищу решение вместе с другими (альпака).
# д) Использую юмор и лёгкость, чтобы разрядить обстановку (фламинго).

# Что для вас важнее всего в дружбе?
# а) Верность и преданность (волк).
# б) Умение поддержать и быть рядом в трудную минуту (цапля).
# в) Общие интересы и увлечения (какаду).
# г) Честность и открытость (барс).
# д) Веселье и радость общения (фламинго).

# Как вы относитесь к переменам в жизни?
# а) Люблю перемены и всегда готов к новым приключениям (фенёк).
# б) Предпочитаю стабильность и не люблю неожиданностей (морской заяц).
# в) Готов к переменам, если они ведут к лучшему (альпака).
# г) Боюсь перемен и стараюсь их избегать (цапля).
# д) Воспринимаю перемены как возможность для роста и развития (какаду).

# Как вы справляетесь со стрессом?
# а) Занимаюсь спортом или физической активностью (волк).
# б) Провожу время с друзьями и близкими (альпака).
# в) Практикую медитацию или йогу (фенёк).
# г) Читаю книги или смотрю фильмы (морской заяц).
# д) Занимаюсь творчеством (фламинго).

# Как вы воспринимаете критику?
# а) Принимаю её конструктивно и стараюсь улучшить свои навыки (барс).
# б) Обижаюсь и злюсь (цапля).
# в) Игнорирую её, считая, что она не имеет значения (волк).
# г) Слушаю её внимательно и стараюсь понять точку зрения другого человека (альпака).
# д) Отношусь к ней с юмором и не принимаю близко к сердцу (фламинго).

# Как вы достигаете своих целей?
# а) Ставлю перед собой чёткие цели и разрабатываю план действий (волк).
# б) Ищу поддержку и помощь у других людей (альпака).
# в) Следую своим инстинктам и интуиции (фенёк).
# г) Анализирую ситуацию и выбираю наиболее подходящий вариант действий (барс).
# д) Мечтаю о большом и верю в лучшее (фламинго).

# Как вы проводите свободное время?
# а) Гуляю на свежем воздухе (фенёк).
# б) Посещаю музеи и выставки (альпака).
# в) Играю в настольные игры или читаю книги (морской заяц).
# г) Встречаюсь с друзьями и хожу на вечеринки (какаду).
# д) Путешествую и изучаю новые места (цапля).

# Как вы выражаете свои чувства?
# а) Через действия и поступки (волк).
# б) Через слова и разговоры (барс).
# в) Через творчество и искусство (фламинго).
# г) Через мимику и жесты (цапля).
# д) Через объятия и прикосновения (морской заяц).
